open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ota_source_http.c
/****************************************************************************
 * chips/bk7258/ap/
 * bk7258_ota_source_http.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * AP-owned HTTPS Range source.  Wi-Fi only supplies wlan0; CP never owns an
 * HTTP/TLS stack.
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_OTA_SOURCE_HTTP

#include <arpa/inet.h>
#include <netinet/in.h>
#include <sys/socket.h>
#include <sys/stat.h>
#include <sys/time.h>

#include <errno.h>
#include <fcntl.h>
#include <netdb.h>
#include <poll.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>
#include <syslog.h>
#include <time.h>
#include <unistd.h>

#include <nuttx/kmalloc.h>
#include <nuttx/clock.h>
#include <nuttx/net/net.h>
#include <nuttx/semaphore.h>

#include <mbedtls/ctr_drbg.h>
#include <mbedtls/entropy.h>
#include <mbedtls/net_sockets.h>
#include <mbedtls/pk.h>
#include <mbedtls/sha256.h>
#include <mbedtls/ssl.h>
#include <mbedtls/x509_crt.h>

#include <arch/chip/bk7258_ota_catalog.h>
#include <arch/chip/bk7258_ota_source_http.h>

#define BK7258_OTA_HTTP_URL_SIZE       384u
#define BK7258_OTA_HTTP_HOST_SIZE      96u
#define BK7258_OTA_HTTP_PORT_SIZE      6u
#define BK7258_OTA_HTTP_PATH_SIZE      256u
#define BK7258_OTA_HTTP_CA_MAX         8192u
#define BK7258_OTA_HTTP_HEADER_MAX     1024u
#define BK7258_OTA_HTTP_IO_TIMEOUT_MS  15000u
#define BK7258_OTA_HTTP_RANGE_CACHE_SIZE 16384u
#define BK7258_OTA_HTTP_CATALOG_NAME   "catalog.json"
#define BK7258_OTA_HTTP_SIGNATURE_NAME "catalog.sig"

struct bk7258_ota_http_url_s
{
  char host[BK7258_OTA_HTTP_HOST_SIZE];
  char port[BK7258_OTA_HTTP_PORT_SIZE];
  char path[BK7258_OTA_HTTP_PATH_SIZE];
  bool secure;
};

struct bk7258_ota_http_source_priv_s
{
  char catalog_url[BK7258_OTA_HTTP_URL_SIZE];
  char signature_url[BK7258_OTA_HTTP_URL_SIZE];
  char object_url[2][BK7258_OTA_HTTP_URL_SIZE];
  char ca_path[BK7258_OTA_HTTP_PATH_SIZE];
  struct bk7258_ota_catalog_s catalog;
  mbedtls_entropy_context entropy;
  mbedtls_ctr_drbg_context random;
  mbedtls_x509_crt ca;
  mbedtls_x509_crt *borrowed_ca;
  mbedtls_x509_crt *borrowed_client_certificate;
  mbedtls_pk_context *borrowed_client_key;
  struct in_addr peer_address;
  struct socket socket;
  mbedtls_ssl_context ssl;
  mbedtls_ssl_config config;
  uint8_t *range_cache;
  enum bk7258_ota_image_e range_cache_image;
  uint32_t range_cache_start;
  uint32_t range_cache_length;
  uint8_t expected_catalog_sha256[BK7258_OTA_SHA256_SIZE];
  bool range_cache_valid;
  bool socket_open;
  bool tls_active;
  bool secure;
  bool crypto_ready;
  bool borrowed_credentials;
  bool peer_address_valid;
  bool expected_catalog_set;
  bool open_attempted;
  volatile bool canceled;
};

static bool bk7258_ota_http_certificate_ready(
  const mbedtls_x509_crt *certificate)
{
  return certificate != NULL && certificate->raw.p != NULL &&
         certificate->raw.len != 0u;
}

static bool bk7258_ota_http_key_ready(const mbedtls_pk_context *key)
{
  return key != NULL && key->pk_info != NULL;
}

static int bk7258_ota_http_copy(char *output, size_t output_size,
                                const char *input)
{
  size_t length = strlen(input);

  if (length == 0u || length >= output_size)
    {
      return -ENAMETOOLONG;
    }

  memcpy(output, input, length + 1u);
  return 0;
}

static int bk7258_ota_http_parse_url(const char *url,
                                     struct bk7258_ota_http_url_s *parsed)
{
  const char *authority;
  const char *path;
  const char *colon;
  size_t host_size;
  size_t port_size;

  if (strncmp(url, "https://", 8u) == 0)
    {
      parsed->secure = true;
      authority = url + 8u;
    }
#ifdef CONFIG_BK7258_OTA_SOURCE_HTTP_PLAINTEXT
  else if (strncmp(url, "http://", 7u) == 0)
    {
      parsed->secure = false;
      authority = url + 7u;
    }
#endif
  else
    {
      return -EPROTONOSUPPORT;
    }

  path = strchr(authority, '/');
  if (path == NULL || path == authority || strlen(path) >= sizeof(parsed->path))
    {
      return -EINVAL;
    }

  colon = memchr(authority, ':', (size_t)(path - authority));
  host_size = (size_t)((colon == NULL ? path : colon) - authority);
  if (host_size == 0u || host_size >= sizeof(parsed->host))
    {
      return -EINVAL;
    }
  memcpy(parsed->host, authority, host_size);
  parsed->host[host_size] = '\0';

  if (colon == NULL)
    {
      if (parsed->secure)
        {
          memcpy(parsed->port, "443", sizeof("443"));
        }
      else
        {
          memcpy(parsed->port, "80", sizeof("80"));
        }
    }
  else
    {
      port_size = (size_t)(path - colon - 1);
      if (port_size == 0u || port_size >= sizeof(parsed->port))
        {
          return -EINVAL;
        }
      memcpy(parsed->port, colon + 1, port_size);
      parsed->port[port_size] = '\0';
    }

  memcpy(parsed->path, path, strlen(path) + 1u);
  return 0;
}

static int bk7258_ota_http_derive_urls(
  struct bk7258_ota_http_source_priv_s *priv)
{
  size_t length = strlen(priv->catalog_url);
  size_t prefix;
  int image;

  if (length <= sizeof(BK7258_OTA_HTTP_CATALOG_NAME) - 1u ||
      strcmp(priv->catalog_url + length -
             (sizeof(BK7258_OTA_HTTP_CATALOG_NAME) - 1u),
             BK7258_OTA_HTTP_CATALOG_NAME) != 0)
    {
      return -EINVAL;
    }

  prefix = length - (sizeof(BK7258_OTA_HTTP_CATALOG_NAME) - 1u);
  if (prefix + sizeof(BK7258_OTA_HTTP_SIGNATURE_NAME) >
      sizeof(priv->signature_url))
    {
      return -ENAMETOOLONG;
    }
  memcpy(priv->signature_url, priv->catalog_url, prefix);
  memcpy(priv->signature_url + prefix, BK7258_OTA_HTTP_SIGNATURE_NAME,
         sizeof(BK7258_OTA_HTTP_SIGNATURE_NAME));

  for (image = BK7258_OTA_IMAGE_CP; image <= BK7258_OTA_IMAGE_AP; image++)
    {
      size_t uri_size = strlen(priv->catalog.uri[image]);
      if (prefix + uri_size >= sizeof(priv->object_url[image]))
        {
          return -ENAMETOOLONG;
        }
      memcpy(priv->object_url[image], priv->catalog_url, prefix);
      memcpy(priv->object_url[image] + prefix, priv->catalog.uri[image],
             uri_size + 1u);
    }

