open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ota_source_http.c
  return 0;
}

static void bk7258_ota_http_disconnect(
  struct bk7258_ota_http_source_priv_s *priv)
{
  if (priv->socket_open && priv->tls_active)
    {
      (void)mbedtls_ssl_close_notify(&priv->ssl);
    }
  if (priv->socket_open)
    {
      (void)psock_close(&priv->socket);
      priv->socket_open = false;
    }
  memset(&priv->socket, 0, sizeof(priv->socket));
  mbedtls_ssl_free(&priv->ssl);
  mbedtls_ssl_config_free(&priv->config);
  mbedtls_ssl_init(&priv->ssl);
  mbedtls_ssl_config_init(&priv->config);
  priv->tls_active = false;
}

static int bk7258_ota_http_read_tls(
  struct bk7258_ota_http_source_priv_s *priv, uint8_t *buffer, size_t size)
{
  size_t done = 0u;

  while (done < size)
    {
      int ret;

      if (__atomic_load_n(&priv->canceled, __ATOMIC_ACQUIRE))
        {
          return -ECANCELED;
        }
      ret = priv->tls_active ?
            mbedtls_ssl_read(&priv->ssl, buffer + done, size - done) :
            psock_recv(&priv->socket, buffer + done, size - done, 0);
      if (ret == MBEDTLS_ERR_SSL_WANT_READ ||
          ret == MBEDTLS_ERR_SSL_WANT_WRITE)
        {
          continue;
        }
      if (ret <= 0)
        {
          syslog(LOG_ERR, "BKOTA HTTP read tls=%u result=%d done=%u size=%u\n",
                 priv->tls_active ? 1u : 0u, ret,
                 (unsigned int)done, (unsigned int)size);
          return ret == 0 ? -ECONNRESET : -EIO;
        }
      done += (size_t)ret;
    }

  return 0;
}

static int bk7258_ota_http_write_tls(
  struct bk7258_ota_http_source_priv_s *priv, const uint8_t *buffer,
  size_t size)
{
  size_t done = 0u;

  while (done < size)
    {
      int ret = priv->tls_active ?
                mbedtls_ssl_write(&priv->ssl, buffer + done, size - done) :
                psock_send(&priv->socket, buffer + done, size - done, 0);
      if (ret == MBEDTLS_ERR_SSL_WANT_READ ||
          ret == MBEDTLS_ERR_SSL_WANT_WRITE)
        {
          continue;
        }
      if (ret <= 0)
        {
          return -EIO;
        }
      done += (size_t)ret;
    }

  return 0;
}

static int bk7258_ota_http_tls_send(void *context,
                                    const unsigned char *buffer,
                                    size_t size)
{
  ssize_t ret = psock_send((struct socket *)context, buffer, size, 0);

  if (ret == -EAGAIN || ret == -EWOULDBLOCK)
    {
      return MBEDTLS_ERR_SSL_WANT_WRITE;
    }

  return ret < 0 ? MBEDTLS_ERR_NET_SEND_FAILED : (int)ret;
}

static int bk7258_ota_http_tls_recv(void *context, unsigned char *buffer,
                                    size_t size)
{
  ssize_t ret = psock_recv((struct socket *)context, buffer, size, 0);

  if (ret == -EAGAIN || ret == -EWOULDBLOCK)
    {
      return MBEDTLS_ERR_SSL_WANT_READ;
    }

  return ret < 0 ? MBEDTLS_ERR_NET_RECV_FAILED : (int)ret;
}

static int bk7258_ota_http_wait_connected(
  struct bk7258_ota_http_source_priv_s *priv)
{
  struct pollfd pfd;
  sem_t sem;
  socklen_t error_size = sizeof(int);
  int socket_error = 0;
  bool polling = false;
  const char *stage = "poll-setup";
  int ret;

  ret = nxsem_init(&sem, 0, 0);
  if (ret < 0)
    {
      return ret;
    }

  memset(&pfd, 0, sizeof(pfd));
  pfd.fd = -1;
  pfd.events = POLLOUT;
  pfd.arg = &sem;
  pfd.cb = poll_default_cb;
  ret = psock_poll(&priv->socket, &pfd, true);
  if (ret >= 0)
    {
      polling = true;
      if (pfd.revents == 0)
        {
          stage = "poll-wait";
          ret = nxsem_tickwait_uninterruptible(
                  &sem, MSEC2TICK(BK7258_OTA_HTTP_IO_TIMEOUT_MS));
        }
    }

  if (polling)
    {
      int teardown = psock_poll(&priv->socket, &pfd, false);
      if (ret >= 0 && teardown < 0)
        {
          stage = "poll-teardown";
          ret = teardown;
        }
    }
  (void)nxsem_destroy(&sem);
  if (ret < 0)
    {
      /* Preserve the actual failure: callback exhaustion or cancellation is
       * not evidence that the network has no route to the phone. */
      syslog(LOG_ERR, "BKOTA HTTP connect stage=%s error=%d events=%x\n",
             stage, ret, (unsigned int)pfd.revents);
      return ret;
    }

  ret = psock_getsockopt(&priv->socket, SOL_SOCKET, SO_ERROR,
                         &socket_error, &error_size);
  if (ret < 0)
    {
      syslog(LOG_ERR, "BKOTA HTTP connect stage=socket-status error=%d\n",
             ret);
      return ret;
    }
  if (socket_error != 0)
    {
      syslog(LOG_ERR, "BKOTA HTTP connect stage=socket-error error=%d "
             "events=%x\n", socket_error, (unsigned int)pfd.revents);
      return socket_error < 0 ? socket_error : -socket_error;
    }

  if ((pfd.revents & POLLOUT) == 0)
    {
      syslog(LOG_ERR, "BKOTA HTTP connect stage=not-writable events=%x\n",
             (unsigned int)pfd.revents);
    }
  return (pfd.revents & POLLOUT) != 0 ? 0 : -ENETUNREACH;
}

static int bk7258_ota_http_connect(
  struct bk7258_ota_http_source_priv_s *priv,
  const struct bk7258_ota_http_url_s *url)
{
  struct addrinfo hints;
  struct addrinfo numeric_address;
  struct addrinfo *addresses = NULL;
  struct addrinfo *address;
  struct sockaddr_in numeric_sockaddr;
  struct timeval timeout;
  unsigned long port;
  bool allocated_addresses = false;
  int ret = -ENETUNREACH;

  bk7258_ota_http_disconnect(priv);
  timeout.tv_sec = BK7258_OTA_HTTP_IO_TIMEOUT_MS / 1000u;
  timeout.tv_usec =
    (BK7258_OTA_HTTP_IO_TIMEOUT_MS % 1000u) * 1000u;
  memset(&hints, 0, sizeof(hints));
  hints.ai_family = AF_UNSPEC;
  hints.ai_socktype = SOCK_STREAM;
  hints.ai_protocol = IPPROTO_TCP;

  memset(&numeric_address, 0, sizeof(numeric_address));
  memset(&numeric_sockaddr, 0, sizeof(numeric_sockaddr));
  port = strtoul(url->port, NULL, 10);
  if (port > 0u && port <= UINT16_MAX && priv->peer_address_valid)
    {
      numeric_sockaddr.sin_addr = priv->peer_address;
      numeric_sockaddr.sin_family = AF_INET;
      numeric_sockaddr.sin_port = htons((uint16_t)port);
      numeric_address.ai_family = AF_INET;
      numeric_address.ai_socktype = SOCK_STREAM;
      numeric_address.ai_protocol = IPPROTO_TCP;
      numeric_address.ai_addrlen = sizeof(numeric_sockaddr);
      numeric_address.ai_addr = (struct sockaddr *)&numeric_sockaddr;
      addresses = &numeric_address;
    }
  else if (port > 0u && port <= UINT16_MAX &&
      inet_pton(AF_INET, url->host, &numeric_sockaddr.sin_addr) == 1)
    {
      numeric_sockaddr.sin_family = AF_INET;
      numeric_sockaddr.sin_port = htons((uint16_t)port);
      numeric_address.ai_family = AF_INET;
      numeric_address.ai_socktype = SOCK_STREAM;
      numeric_address.ai_protocol = IPPROTO_TCP;
      numeric_address.ai_addrlen = sizeof(numeric_sockaddr);
      numeric_address.ai_addr = (struct sockaddr *)&numeric_sockaddr;
      addresses = &numeric_address;
    }
  else if (getaddrinfo(url->host, url->port, &hints, &addresses) != 0)
    {
      return -ENETUNREACH;
    }
  else
    {
      allocated_addresses = true;
    }

  for (address = addresses; address != NULL; address = address->ai_next)
    {
      struct timespec connect_started;
      bool connect_clock_valid;

      ret = psock_socket(address->ai_family,
                         address->ai_socktype | SOCK_NONBLOCK,
                         address->ai_protocol, &priv->socket);
      if (ret < 0)
        {
          continue;
        }

      priv->socket_open = true;
      ret = psock_setsockopt(&priv->socket, SOL_SOCKET, SO_RCVTIMEO,
                             &timeout, sizeof(timeout));
      if (ret >= 0)
        {
          ret = psock_setsockopt(&priv->socket, SOL_SOCKET, SO_SNDTIMEO,
                                 &timeout, sizeof(timeout));
        }
      if (ret < 0)
        {
          (void)psock_close(&priv->socket);
          memset(&priv->socket, 0, sizeof(priv->socket));
          priv->socket_open = false;
          continue;
        }

      connect_clock_valid = clock_gettime(CLOCK_MONOTONIC,
                                           &connect_started) == 0;
      ret = psock_connect(&priv->socket, address->ai_addr,
                          address->ai_addrlen);
      if (ret < 0 && ret != -EINPROGRESS)
        {
          struct timespec finished;
          long elapsed_ms = -1;

          if (connect_clock_valid &&
              clock_gettime(CLOCK_MONOTONIC, &finished) == 0)
            {
              elapsed_ms = (finished.tv_sec - connect_started.tv_sec) * 1000 +
                (finished.tv_nsec - connect_started.tv_nsec) / 1000000;
            }

