open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ota_source_http.c
          syslog(LOG_ERR,
                 "BKOTA HTTP connect stage=connect error=%d elapsed_ms=%ld\n",
                 ret, elapsed_ms);
        }
      if (ret == -EINPROGRESS)
        {
          ret = bk7258_ota_http_wait_connected(priv);
        }
      if (ret >= 0)
        {
          int nonblock = 0;

          ret = psock_ioctl(&priv->socket, FIONBIO,
                            (unsigned long)(uintptr_t)&nonblock);
        }
      if (ret >= 0)
        {
          break;
        }

      (void)psock_close(&priv->socket);
      memset(&priv->socket, 0, sizeof(priv->socket));
      priv->socket_open = false;
    }

  if (allocated_addresses)
    {
      freeaddrinfo(addresses);
    }
  if (ret < 0)
    {
      return ret;
    }

  priv->tls_active = url->secure;
  if (!url->secure)
    {
      return 0;
    }

  ret = mbedtls_ssl_config_defaults(&priv->config,
                                    MBEDTLS_SSL_IS_CLIENT,
                                    MBEDTLS_SSL_TRANSPORT_STREAM,
                                    MBEDTLS_SSL_PRESET_DEFAULT);
  if (ret == 0)
    {
      mbedtls_ssl_conf_authmode(&priv->config,
                                MBEDTLS_SSL_VERIFY_REQUIRED);
      mbedtls_ssl_conf_ca_chain(&priv->config,
                                priv->borrowed_credentials ?
                                priv->borrowed_ca : &priv->ca, NULL);
      mbedtls_ssl_conf_rng(&priv->config, mbedtls_ctr_drbg_random,
                           &priv->random);
      if (priv->borrowed_client_certificate != NULL)
        {
          ret = mbedtls_ssl_conf_own_cert(
                  &priv->config, priv->borrowed_client_certificate,
                  priv->borrowed_client_key);
        }
    }
  if (ret == 0)
    {
      ret = mbedtls_ssl_setup(&priv->ssl, &priv->config);
    }
  if (ret == 0)
    {
      ret = mbedtls_ssl_set_hostname(&priv->ssl, url->host);
    }
  if (ret == 0)
    {
      mbedtls_ssl_set_bio(&priv->ssl, &priv->socket,
                          bk7258_ota_http_tls_send,
                          bk7258_ota_http_tls_recv, NULL);
      do
        {
          ret = mbedtls_ssl_handshake(&priv->ssl);
        }
      while (ret == MBEDTLS_ERR_SSL_WANT_READ ||
             ret == MBEDTLS_ERR_SSL_WANT_WRITE);
    }
  if (ret != 0 || mbedtls_ssl_get_verify_result(&priv->ssl) != 0u)
    {
      bk7258_ota_http_disconnect(priv);
      return -EKEYREJECTED;
    }

  return 0;
}

static int bk7258_ota_http_headers(
  struct bk7258_ota_http_source_priv_s *priv, int *status,
  uint32_t *content_length, uint32_t *range_start)
{
  char header[BK7258_OTA_HTTP_HEADER_MAX];
  size_t used = 0u;
  char *line;
  char *save;

  while (used + 1u < sizeof(header))
    {
      int ret = bk7258_ota_http_read_tls(
                  priv, (uint8_t *)&header[used], 1u);
      if (ret < 0)
        {
          return ret;
        }
      used++;
      if (used >= 4u && memcmp(&header[used - 4u], "\r\n\r\n", 4u) == 0)
        {
          break;
        }
    }
  if (used + 1u >= sizeof(header))
    {
      return -EOVERFLOW;
    }
  header[used] = '\0';

  *content_length = UINT32_MAX;
  *range_start = UINT32_MAX;
  line = strtok_r(header, "\r\n", &save);
  if (line == NULL || sscanf(line, "HTTP/%*u.%*u %d", status) != 1)
    {
      return -EPROTO;
    }
  while ((line = strtok_r(NULL, "\r\n", &save)) != NULL)
    {
      unsigned long value;

      if (strncasecmp(line, "Content-Length:", 15u) == 0 &&
          sscanf(line + 15u, "%lu", &value) == 1 && value <= UINT32_MAX)
        {
          *content_length = (uint32_t)value;
        }
      else if (strncasecmp(line, "Content-Range:", 14u) == 0 &&
               sscanf(line + 14u, " bytes %lu-", &value) == 1 &&
               value <= UINT32_MAX)
        {
          *range_start = (uint32_t)value;
        }
    }

  return *content_length == UINT32_MAX ? -EPROTO : 0;
}

static int bk7258_ota_http_begin(
  struct bk7258_ota_http_source_priv_s *priv, const char *url,
  bool range, uint32_t offset, uint32_t expected_length)
{
  struct bk7258_ota_http_url_s parsed;
  char request[512];
  uint32_t content_length;
  uint32_t range_start;
  int status;
  int size;
  int ret;

  memset(&parsed, 0, sizeof(parsed));
  ret = bk7258_ota_http_parse_url(url, &parsed);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_ota_http_connect(priv, &parsed);
  if (ret < 0)
    {
      return ret;
    }

  if (expected_length == 0u ||
      (uint64_t)offset + expected_length > (uint64_t)UINT32_MAX + 1u)
    {
      bk7258_ota_http_disconnect(priv);
      return -EINVAL;
    }

  if (range)
    {
      size = snprintf(
        request, sizeof(request),
        "GET %s HTTP/1.1\r\nHost: %s\r\nRange: bytes=%lu-%lu\r\n"
        "Connection: close\r\nUser-Agent: openvela-bk7258-ota/1\r\n\r\n",
        parsed.path, parsed.host, (unsigned long)offset,
        (unsigned long)(offset + expected_length - 1u));
    }
  else
    {
      size = snprintf(
        request, sizeof(request),
        "GET %s HTTP/1.1\r\nHost: %s\r\nConnection: close\r\n"
        "User-Agent: openvela-bk7258-ota/1\r\n\r\n",
        parsed.path, parsed.host);
    }
  if (size <= 0 || (size_t)size >= sizeof(request))
    {
      return -ENAMETOOLONG;
    }

  ret = bk7258_ota_http_write_tls(priv, (const uint8_t *)request,
                                  (size_t)size);
  if (ret == 0)
    {
      ret = bk7258_ota_http_headers(priv, &status, &content_length,
                                    &range_start);
    }
  if (ret == 0 &&
      ((!range && status != 200) ||
       (range && (status != 206 || range_start != offset)) ||
       content_length != expected_length))
    {
      ret = -EPROTO;
    }
  if (ret < 0)
    {
      bk7258_ota_http_disconnect(priv);
    }
  return ret;
}

static int bk7258_ota_http_download_small(
  struct bk7258_ota_http_source_priv_s *priv, const char *url,
  uint8_t *buffer, size_t capacity, size_t *size)
{
  struct bk7258_ota_http_url_s parsed;
  struct bk7258_ota_http_source_priv_s *p = priv;
  char request[512];
  uint32_t content_length;
  uint32_t range_start;
  int status;
  int request_size;
  int ret;

  memset(&parsed, 0, sizeof(parsed));
  ret = bk7258_ota_http_parse_url(url, &parsed);
  if (ret == 0)
    {
      ret = bk7258_ota_http_connect(p, &parsed);
    }
  request_size = snprintf(
    request, sizeof(request),
    "GET %s HTTP/1.1\r\nHost: %s\r\nConnection: close\r\n"
    "User-Agent: openvela-bk7258-ota/1\r\n\r\n",
    parsed.path, parsed.host);
  if (ret == 0 &&
      (request_size <= 0 || (size_t)request_size >= sizeof(request)))
    {
      ret = -ENAMETOOLONG;
    }
  if (ret == 0)
    {
      ret = bk7258_ota_http_write_tls(
              p, (const uint8_t *)request, (size_t)request_size);
    }
  if (ret == 0)
    {
      ret = bk7258_ota_http_headers(p, &status, &content_length,
                                    &range_start);
    }
  if (ret == 0 && (status != 200 || content_length == 0u ||
                   content_length > capacity))
    {
      ret = -EFBIG;
    }
  if (ret == 0)
    {
      ret = bk7258_ota_http_read_tls(p, buffer, content_length);
    }
  if (ret == 0)
    {
      *size = content_length;
    }
  bk7258_ota_http_disconnect(p);
  return ret;
}

static int bk7258_ota_http_load_ca(
  struct bk7258_ota_http_source_priv_s *priv)
{
  struct stat status;
  uint8_t *buffer;
  size_t done = 0u;
  int fd;
  int ret;

