open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ota_source_http.c
  fd = open(priv->ca_path, O_RDONLY);
  if (fd < 0)
    {
      return -errno;
    }
  if (fstat(fd, &status) < 0 || !S_ISREG(status.st_mode) ||
      status.st_size <= 0 || status.st_size >= BK7258_OTA_HTTP_CA_MAX)
    {
      close(fd);
      return -EINVAL;
    }

  buffer = kmm_malloc((size_t)status.st_size + 1u);
  if (buffer == NULL)
    {
      close(fd);
      return -ENOMEM;
    }
  while (done < (size_t)status.st_size)
    {
      ssize_t count = read(fd, buffer + done,
                           (size_t)status.st_size - done);
      if (count <= 0)
        {
          kmm_free(buffer);
          close(fd);
          return count < 0 ? -errno : -EIO;
        }
      done += (size_t)count;
    }
  close(fd);
  buffer[done] = '\0';
  ret = mbedtls_x509_crt_parse(&priv->ca, buffer, done + 1u);
  kmm_free(buffer);
  return ret == 0 ? 0 : -EKEYREJECTED;
}

static int bk7258_ota_http_catalog_expected(
  const struct bk7258_ota_http_source_priv_s *priv,
  const uint8_t *catalog, size_t catalog_size)
{
  uint8_t digest[BK7258_OTA_SHA256_SIZE];
  int ret;

  if (!priv->expected_catalog_set)
    {
      return 0;
    }

  ret = mbedtls_sha256(catalog, catalog_size, digest, 0);
  if (ret != 0)
    {
      return ret;
    }

  return memcmp(digest, priv->expected_catalog_sha256, sizeof(digest)) == 0 ?
         0 : -EBADMSG;
}

static int bk7258_ota_http_open(
  void *context, struct bk7258_ota_manifest_s *manifest)
{
  struct bk7258_ota_http_source_s *source = context;
  struct bk7258_ota_http_source_priv_s *priv = source->priv;
  uint8_t catalog[BK7258_OTA_CATALOG_MAX_SIZE];
  uint8_t signature[BK7258_OTA_CATALOG_MAX_SIGNATURE];
  size_t catalog_size;
  size_t signature_size;
  static const uint8_t personalization[] = "bk7258-ota-source-http-v1";
  int ret;

  if (priv == NULL || manifest == NULL)
    {
      return -EINVAL;
    }

  /* An expectation is configuration, not a mutable transfer parameter. */

  priv->open_attempted = true;

  ret = 0;
  if (priv->secure)
    {
      ret = mbedtls_ctr_drbg_seed(&priv->random, mbedtls_entropy_func,
                                  &priv->entropy, personalization,
                                  sizeof(personalization) - 1u);
      if (ret == 0)
        {
          if (!priv->borrowed_credentials)
            {
              ret = bk7258_ota_http_load_ca(priv);
            }
        }
      if (ret == 0)
        {
          priv->crypto_ready = true;
        }
    }
  if (ret == 0)
    {
      ret = bk7258_ota_http_download_small(
              priv, priv->catalog_url, catalog, sizeof(catalog),
              &catalog_size);
    }
  if (ret == 0)
    {
      ret = bk7258_ota_http_download_small(
              priv, priv->signature_url, signature, sizeof(signature),
              &signature_size);
    }
  if (ret == 0)
    {
      ret = bk7258_ota_catalog_verify(catalog, catalog_size,
                                      signature, signature_size,
                                      &priv->catalog);
    }
  if (ret == 0 && priv->expected_catalog_set)
    {
      ret = bk7258_ota_http_catalog_expected(priv, catalog, catalog_size);
    }
  if (ret == 0)
    {
      ret = bk7258_ota_http_derive_urls(priv);
    }
  if (ret == 0)
    {
      memcpy(manifest, &priv->catalog.manifest, sizeof(*manifest));
    }

  return ret;
}

static int bk7258_ota_http_read_at(
  void *context, enum bk7258_ota_image_e image, uint32_t offset,
  uint8_t *buffer, size_t nbytes)
{
  struct bk7258_ota_http_source_s *source = context;
  struct bk7258_ota_http_source_priv_s *priv = source->priv;
  uint32_t image_size;
  size_t done = 0u;

  if (priv == NULL || buffer == NULL || nbytes == 0u ||
      image < BK7258_OTA_IMAGE_CP || image > BK7258_OTA_IMAGE_AP)
    {
      return -EINVAL;
    }

  image_size = priv->catalog.manifest.image[image].physical_size;
  if ((uint64_t)offset + nbytes > image_size)
    {
      return -EINVAL;
    }

  if (__atomic_load_n(&priv->canceled, __ATOMIC_ACQUIRE))
    {
      return -ECANCELED;
    }

  while (done < nbytes)
    {
      uint32_t position = offset + (uint32_t)done;
      uint32_t cache_end = priv->range_cache_start +
                           priv->range_cache_length;
      size_t available;
      size_t copy_size;
      int ret;

      if (!priv->range_cache_valid || priv->range_cache_image != image ||
          position < priv->range_cache_start || position >= cache_end)
        {
          uint32_t length = image_size - position;

          if (length > BK7258_OTA_HTTP_RANGE_CACHE_SIZE)
            {
              length = BK7258_OTA_HTTP_RANGE_CACHE_SIZE;
            }

          priv->range_cache_valid = false;
          ret = bk7258_ota_http_begin(priv, priv->object_url[image], true,
                                      position, length);
          if (ret == 0)
            {
              ret = bk7258_ota_http_read_tls(priv, priv->range_cache,
                                             length);
            }
          bk7258_ota_http_disconnect(priv);
          if (ret < 0)
            {
              syslog(LOG_ERR,
                     "BKOTA HTTP range image=%u offset=%lu size=%lu error=%d\n",
                     (unsigned int)image, (unsigned long)position,
                     (unsigned long)length, ret);
              return ret;
            }

          priv->range_cache_image = image;
          priv->range_cache_start = position;
          priv->range_cache_length = length;
          priv->range_cache_valid = true;
          cache_end = position + length;
        }

      available = cache_end - position;
      copy_size = nbytes - done;
      if (copy_size > available)
        {
          copy_size = available;
        }
      memcpy(buffer + done,
             priv->range_cache + position - priv->range_cache_start,
             copy_size);
      done += copy_size;
    }

  return 0;
}

static int bk7258_ota_http_checkpoint(
  void *context, const struct bk7258_ota_progress_s *progress)
{
  struct bk7258_ota_http_source_s *source = context;
  struct bk7258_ota_http_source_priv_s *priv = source->priv;

  (void)progress;
  return priv != NULL &&
         __atomic_load_n(&priv->canceled, __ATOMIC_ACQUIRE) ?
         -ECANCELED : 0;
}

static int bk7258_ota_http_cancel(void *context)
{
  struct bk7258_ota_http_source_s *source = context;
  struct bk7258_ota_http_source_priv_s *priv = source->priv;

  if (priv == NULL)
    {
      return -EINVAL;
    }
  if (__atomic_exchange_n(&priv->canceled, true, __ATOMIC_ACQ_REL))
    {
      return 0;
    }

  if (priv->socket_open)
    {
      (void)psock_shutdown(&priv->socket, SHUT_RDWR);
    }
  return 0;
}

static void bk7258_ota_http_close(void *context)
{
  struct bk7258_ota_http_source_s *source = context;
  struct bk7258_ota_http_source_priv_s *priv = source->priv;

  if (priv == NULL)
    {
      return;
    }
  bk7258_ota_http_disconnect(priv);
  kmm_free(priv->range_cache);
  mbedtls_x509_crt_free(&priv->ca);
  mbedtls_ctr_drbg_free(&priv->random);
  mbedtls_entropy_free(&priv->entropy);
  kmm_free(priv);
  source->priv = NULL;
}

