open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ota_source_http.c
static const struct bk7258_ota_source_ops_s g_bk7258_ota_http_ops =
{
  .open = bk7258_ota_http_open,
  .read_at = bk7258_ota_http_read_at,
  .checkpoint = bk7258_ota_http_checkpoint,
  .cancel = bk7258_ota_http_cancel,
  .close = bk7258_ota_http_close,
};

static int bk7258_ota_http_source_initialize_common(
  struct bk7258_ota_http_source_s *source, const char *catalog_url,
  const char *ca_path, const struct in_addr *peer_address,
  mbedtls_x509_crt *server_ca,
  mbedtls_x509_crt *client_certificate, mbedtls_pk_context *client_key,
  bool require_client_certificate)
{
  struct bk7258_ota_http_source_priv_s *priv;
  struct bk7258_ota_http_url_s parsed;
  int ret;

  if (source == NULL || catalog_url == NULL || source->priv != NULL ||
      (ca_path == NULL &&
       (server_ca == NULL ||
        (require_client_certificate &&
         (client_certificate == NULL || client_key == NULL)))))
    {
      return -EINVAL;
    }

  priv = kmm_zalloc(sizeof(*priv));
  if (priv == NULL)
    {
      return -ENOMEM;
    }
  priv->range_cache = kmm_malloc(BK7258_OTA_HTTP_RANGE_CACHE_SIZE);
  if (priv->range_cache == NULL)
    {
      kmm_free(priv);
      return -ENOMEM;
    }
  ret = bk7258_ota_http_copy(priv->catalog_url,
                             sizeof(priv->catalog_url), catalog_url);
  if (ret == 0)
    {
      memset(&parsed, 0, sizeof(parsed));
      ret = bk7258_ota_http_parse_url(catalog_url, &parsed);
    }
  if (ret == 0)
    {
      priv->secure = parsed.secure;
      if (server_ca != NULL)
        {
          uint32_t address = peer_address == NULL ? 0u :
                             ntohl(peer_address->s_addr);

          if (!priv->secure || !bk7258_ota_http_certificate_ready(server_ca) ||
              (require_client_certificate &&
               (!bk7258_ota_http_certificate_ready(client_certificate) ||
                !bk7258_ota_http_key_ready(client_key))) || address == 0u ||
              address >= 0xe0000000u)
            {
              ret = !priv->secure ? -EPROTONOSUPPORT : -EKEYREJECTED;
            }
          else
            {
              priv->peer_address = *peer_address;
              priv->peer_address_valid = true;
              priv->borrowed_ca = server_ca;
              priv->borrowed_client_certificate = client_certificate;
              priv->borrowed_client_key = client_key;
              priv->borrowed_credentials = true;
            }
        }
      else if (priv->secure)
        {
          ret = bk7258_ota_http_copy(priv->ca_path,
                                     sizeof(priv->ca_path), ca_path);
        }
      else if (ca_path[0] != '\0')
        {
          ret = -EINVAL;
        }
    }
  if (ret == 0)
    {
      ret = bk7258_ota_http_derive_urls(priv);
    }
  if (ret < 0)
    {
      kmm_free(priv->range_cache);
      kmm_free(priv);
      return ret;
    }

  mbedtls_entropy_init(&priv->entropy);
  mbedtls_ctr_drbg_init(&priv->random);
  mbedtls_x509_crt_init(&priv->ca);
  mbedtls_ssl_init(&priv->ssl);
  mbedtls_ssl_config_init(&priv->config);
  source->priv = priv;
  return 0;
}

int bk7258_ota_http_source_initialize(
  struct bk7258_ota_http_source_s *source, const char *catalog_url,
  const char *ca_path)
{
  return bk7258_ota_http_source_initialize_common(source, catalog_url,
                                                   ca_path, NULL, NULL, NULL,
                                                   NULL, false);
}

int bk7258_ota_http_source_initialize_with_credentials(
  struct bk7258_ota_http_source_s *source, const char *catalog_url,
  const struct in_addr *peer_address,
  struct mbedtls_x509_crt *server_ca,
  struct mbedtls_x509_crt *client_certificate,
  struct mbedtls_pk_context *client_key)
{
  return bk7258_ota_http_source_initialize_common(
           source, catalog_url, NULL, peer_address, server_ca,
           client_certificate,
           client_key, true);
}

int bk7258_ota_http_source_initialize_with_server_ca(
  struct bk7258_ota_http_source_s *source, const char *catalog_url,
  const struct in_addr *peer_address, struct mbedtls_x509_crt *server_ca)
{
  /* Server authentication is still mandatory. Only client-certificate
   * authentication is absent on this explicitly selected entry point.
   */
  return bk7258_ota_http_source_initialize_common(
           source, catalog_url, NULL, peer_address, server_ca,
           NULL, NULL, false);
}

int bk7258_ota_http_source_expect_catalog(
  struct bk7258_ota_http_source_s *source,
  const uint8_t sha256[BK7258_OTA_SHA256_SIZE])
{
  struct bk7258_ota_http_source_priv_s *priv;

  if (source == NULL || sha256 == NULL || source->priv == NULL)
    {
      return -EINVAL;
    }

  priv = source->priv;
  if (priv->open_attempted)
    {
      return -EBUSY;
    }

  memcpy(priv->expected_catalog_sha256, sha256,
         sizeof(priv->expected_catalog_sha256));
  priv->expected_catalog_set = true;
  return 0;
}

const struct bk7258_ota_source_ops_s *bk7258_ota_http_source_ops(void)
{
  return &g_bk7258_ota_http_ops;
}

#endif /* CONFIG_BK7258_OTA_SOURCE_HTTP */
